Netology/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Netology/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>Email контрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>Почтовый адрес контрагента</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Netology/src/Catalogs/Контрагенты/ManagerModule.bsl
Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт

	ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	EMailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;

	Выборка = Справочники.Контрагенты.Выбрать();
	Пока Выборка.Следующий() Цикл

		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		КонтрагентОбъект.КонтактнаяИнформация.Очистить();

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьЮридическийАдрес) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ЮридическийАдресКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;
		КонецЕсли;

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьФактическийАдрес) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ФактическийАдресКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьФактическийАдрес;
		КонецЕсли;

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьТелефон) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = ТелефонКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьТелефон;
		КонецЕсли;

		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьEmail) Тогда
			НоваяСтрокаКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Вид = EMailКонтрагента;
			НоваяСтрокаКИ.Значение = КонтрагентОбъект.УдалитьEmail;
		КонецЕсли;

		КонтрагентОбъект.Записать();

	КонецЦикла;
	
КонецПроцедуры
